//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef _BSP_FIFO_H
#define _BSP_FIFO_H


void bsp_fifo_init(INT8U *bufAddr,INT16U maxSize)


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Init
//名称:  bsp_fifo_init
//功能:  fifo初始化 
//入口:  *bufAddr fifo缓冲区地址  <<------------------------传入
//出口:  无
void bsp_fifo_init(INT8U *bufAddr,INT16U maxSize);
//------------------------------E N D-------------------------------------------

//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Init
//名称:  bsp_fifo_wirte
//功能:  fifo写入数据 
//入口:  *ptDat        写入数据首地址  <<------------------------传入
//       *wirteLength  写入数据长度    <<------------------------传入
//出口:  BN_TRUE:写入成功    BN_FALSE:写入失败
BOOLEAN bsp_fifo_wirte(INT8U *ptDat,INT16U wirteLength);
//------------------------------E N D-------------------------------------------




//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Init
//名称:  bsp_fifo_read
//功能:  fifo读出数据 
//入口:  *_out_ptDat   读出数据首地址  <<------------------------传出
//       *readLenth    读出数据长度    <<------------------------传入
//出口:  BN_TRUE:写入成功    BN_FALSE:写入失败
BOOLEAN bsp_fifo_read(INT8U *_out_ptDat,INT16U readLenth);
//------------------------------E N D-------------------------------------------


//++++++++++++++++++++++++++++++start+++++++++++++++++++++++++++++++++++++++++++
//Init
//名称:  bsp_fifo_get_count
//功能:  获取fifo中的数据个数 
//入口:  无
//出口:  BN_TRUE:写入成功    BN_FALSE:写入失败
INT16U bsp_fifo_get_count(void);
//------------------------------E N D-------------------------------------------

#endif
