//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef _MOD_SYSTEMTICK_H
#define _MOD_SYSTEMTICK_H
//-----------------------------------------------------------------------------
#include <stdbool.h>
#include "stdint.h"
//-----------------------------------------------------------------------------
//延时类型
typedef enum
{
    DELAY_TYPE_MS      = 0x00,  
    DELAY_TYPE_SECOND,  
    DELAY_TYPE_MINUTE,
}delayType_t;
//-----------------------------------------------------------------------------
//延时数据
typedef struct
{
    delayType_t  delayType;
    bool         onceTrigger;
    uint16_t     runTick;      //运行延时时间 --处理
    uint16_t     stoTick;      //上次结算时间  
}delayPara_t;
//-----------------------------------------------------------------------------

//------------------------------------------------------------------------------
//init
//名称: 系统时钟配置
//功能: 初始化调用
//入口: 无
//
//出口: 无
void mod_systick_cfg(void);
//------------------------------------------------------------------------------
//task
//名称: 系统时钟运行
//功能: 主循环调用
//入口: 无
//
//出口: 无
void mod_system_tick_scanTask(void);
//------------------------------------------------------------------------------
//名称: GetSysTickMillisecond
//功能: 毫秒时间传出
//入口: 无
//出口: 1ms的系统时钟节拍
uint16_t GetSysTickMillisecond(void);
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//------------------------------------------------------------------------------
//func
//名称 : delayTickClock_run
//功能 : 延时运算函数
//入口 : delayPara_t 类型延时指针  <<------------------------------传入
//出口 : 1ms的系统时钟节拍
void delayTickClock_run(delayPara_t* delayPara);
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++




//------------------------------------------------------------------------------
//func
//名称 : dealyTickClock_reload
//功能 : 延时时间装载函数
//入口 : delayPara_t 类型延时指针  <<------------------------------传入
//       uint16_t    类型延时时间  <<------------------------------传入
//出口 : 1ms的系统时钟节拍
void dealyTickClock_reload(delayPara_t* delayPara,uint16_t delayTime);
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++




//------------------------------------------------------------------------------
//func
//名称 : delayTickClock_status
//功能 : 延时时间装载函数
//入口 : delayPara_t 类型延时指针  <<------------------------------传入
//       bool        单次判断标志  <<------------------------------传入
//出口 : true 延时完成   false 延时未完成
bool delayTickClock_status(delayPara_t* delayPara,bool onceFlag);
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++




#endif
//++++++++++++++++++++++++++++++++++End+++++++++++++++++++++++++++++++++++++++++