//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#ifndef _BSP_SYSTEM_CLOCK_H__
#define _BSP_SYSTEM_CLOCK_H__

#include <stdbool.h>
#include "stdint.h"

//------------------------------------------------------------------------------
//init
//名称: 系统晶振时基配置
//功能: 初始化调用，一般第一个调用
//入口: 无
//
//出口: 无
void bsp_system_clock_cfg(void);


uint32_t bsp_system_clock_getFrqe(void);
//------------------------------------------------------------------------------
//名称: 内置晶振校准
//功能: 
//入口: 无
//
//出口: 无
void bsp_hsi_adj_scanTask(void);
//------------------------------------------------------------------------------
#endif
//++++++++++++++++++++++++++++++++++End+++++++++++++++++++++++++++++++++++++++++